app/views/book/list.html.erb

SELECT "subjects".* FROM "subjects"
---

	<% Subject.all.each do |subject| %>