app/views/book/show_subjects.html.erb

<ul>
<% @subject.books.each do |c| %>
---
SELECT "books".* FROM "books" WHERE "books"."subject_id" = ?  [["subject_id", 1]]