app/views/book/show_subject.html.erb

SELECT "books".* FROM "books" WHERE "books"."subject_id" = ?  [["subject_id", 4]]
---
<ul>
	<% @subject.books.each do |sub|%>