app/controllers/book_controller.rb

  def show
    @book = Book.find(params[:id])
    @subject = Subject.find(@book.subject_id)
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 5]]