app/controllers/book_controller.rb

SELECT "books".* FROM "books"
---
   def list
      @books = Book.all

SELECT "subjects".* FROM "subjects"
---
   def new
      @book = Book.new
      @subjects = Subject.all

INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "geo graphy"], ["price", 456.0], ["subject_id", 5], ["description", "jhc uoihooc oiundc nojc"], ["created_at", "2015-09-01 05:57:12.294165"], ["updated_at", "2015-09-01 05:57:12.294165"]]
SELECT "subjects".* FROM "subjects"
---
   def create

      @book = Book.new(book_params)
      if @book.save
            redirect_to :action => 'list'
      else
            @subjects = Subject.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subjects".* FROM "subjects"
---
   def edit
      @book = Book.find(params[:id])
      @subjects = Subject.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "uhjbjk iouhdc oi"], ["updated_at", "2015-08-31 13:05:56.321554"], ["id", 2]]
---
   def update
      @book = Book.find(params[:id])
      if @book.update_attributes(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 14]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 14]]
---
   def destroy
      Book.find(params[:id]).destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 4]]
---
   def show_subject
      @subject = Subject.find(params[:subject_id])